In [8]:
import pandas
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df=pandas.DataFrame(exam_data)
print(df[(df.attempts<2) & (df.score>15)])

    name  score  attempts qualify
9  Jonas   19.0         1     yes

In [1]:
import pandas as pd
student_data = pd.DataFrame({
'school_code': ['s001','s002','s003','s001','s002','s004'],
'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
'age': [12, 12, 13, 13, 14, 12],
'height': [173, 192, 186, 167, 151, 159],
'weight': [35, 32, 33, 30, 31, 32],
'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
df=pd.DataFrame(student_data)
by_code=df.groupby(['school_code'])
print(by_code.get_group('s001'))
print("MEAN:")
print(by_code.mean())
print("STANDARD DEviATION:")
print(by_code.std())

   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1
MEAN:
              age  height  weight
school_code
s001         12.5   170.0    32.5
s002         13.0   171.5    31.5
s003         13.0   186.0    33.0
s004         12.0   159.0    32.0
STANDARD DEviATION:
                  age     height    weight
school_code
s001         0.707107   4.242641  3.535534
s002         1.414214  28.991378  0.707107
s003              NaN        NaN       NaN
s004              NaN        NaN       NaN

<ipython-input-1-9977002c38a7>:16: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(by_code.mean())
<ipython-input-1-9977002c38a7>:18: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(by_code.std())

In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,"#",70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,"?",12.43,2480.4,250.45, 3045.6],
'ord_date': ['?','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,"#",3002,3001,3001],
'salesman_id':[5002,5003,"?",5001,np.nan,5002,5001,"?",5003,5002,5003,"#"]})
df=df.replace(['#','?'],np.NaN)
df.fillna(method='ffill',limit=1,inplace=True)
df.fillna(method='bfill',limit=1,inplace=True)
print(df)

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-09-10       3002.0       5002.0
1   70001.0     270.65  2012-09-10       3001.0       5003.0
2   70002.0      65.26  2012-09-10       3001.0       5003.0
3   70004.0     110.50  2012-08-17       3003.0       5001.0
4   70004.0     948.50  2012-09-10       3002.0       5001.0
5   70005.0    2400.60  2012-07-27       3001.0       5002.0
6   70005.0    5760.00  2012-09-10       3001.0       5001.0
7   70010.0    5760.00  2012-10-10       3004.0       5001.0
8   70003.0      12.43  2012-10-10       3004.0       5003.0
9   70012.0    2480.40  2012-06-27       3002.0       5002.0
10  70012.0     250.45  2012-08-17       3001.0       5003.0
11  70013.0    3045.60  2012-04-25       3001.0       5003.0